nordic-auko/nRF5-ble-timesync-demo/nRF5_SDK_16.0.0_98a08e2/examples/common/time_sync.c
    if (m_params.high_freq_timer[0] == NRF_TIMER3 || m_params.high_freq_timer[0] == NRF_TIMER4)
    {
        // TIMERS 0,1, and 2 only have 4 compare registers
        m_params.high_freq_timer[0]->CC[4]   = TIME_SYNC_TIMER_MAX_VAL / 2; // Only used for debugging purposes such as pin toggling
    }

    m_params.high_freq_timer[0]->SHORTS      = TIMER_SHORTS_COMPARE0_CLEAR_Msk;
    m_params.high_freq_timer[0]->TASKS_START = 1;
}

uint32_t ts_set_trigger(uint32_t target_tick, uint32_t ppi_endpoint, ts_evt_handler_t callback)
{
	if (!m_timeslot_session_open)
	{
		return NRF_ERROR_INVALID_STATE;
	}

	if (ppi_sync_trigger_configure(ppi_endpoint) != NRF_SUCCESS)
	{
		return NRF_ERROR_INVALID_PARAM;
	}

	m_callback = callback;
	m_trigger_evt.syncPacketCnt = 0;
	m_trigger_evt.usedPacketCnt = 0;

	// TODO: is there a way to check if the target value is plausible?
	m_trigger_evt.startTick = ts_timestamp_get_ticks_u64() / TIME_SYNC_TIMER_MAX_VAL;
	
	// set capture to new target: (target - local_counter) + (local_counter - m_master_counter)
	m_params.high_freq_timer[1]->CC[4] = target_tick - m_master_counter;
	m_trigger_evt.targetTick = target_tick;
	nrf_ppi_channel_enable(m_params.ppi_chns[4]); // activate trigger
	return NRF_SUCCESS;
}

void SWI3_EGU3_IRQHandler(void)
{
    if (NRF_EGU3->EVENTS_TRIGGERED[0] != 0)
    {
        NRF_EGU3->EVENTS_TRIGGERED[0] = 0;

        m_master_counter = mp_curr_adj_pkt->counter_val;
        m_params.high_freq_timer[1]->CC[4] = m_trigger_evt.targetTick - m_master_counter;	// calculate new capture
        m_timer_update_in_progress = false;

        m_trigger_evt.usedPacketCnt++;
        m_trigger_evt.lastSync = m_master_counter;

        nrf_balloc_free(&m_sync_pkt_pool, (void*)mp_curr_adj_pkt);
	}
	else if (NRF_EGU3->EVENTS_TRIGGERED[2] != 0)
	{
		NRF_EGU3->EVENTS_TRIGGERED[2] = 0;
		nrf_ppi_channel_disable(m_params.ppi_chns[4]);

		if (m_callback)
		{
			m_callback(&m_trigger_evt);
		}
	}
}

static inline bool sync_timer_offset_compensate(sync_pkt_t * p_pkt)
{
    uint32_t peer_timer;
    uint32_t local_timer;
    uint32_t timer_offset;

    if (m_timer_update_in_progress)
    {
        return false;
    }

    if (CHECK_INVALID_TIMING(p_pkt->timer_val))
	{
		return false;
	}

    peer_timer  = p_pkt->timer_val;
    peer_timer += TX_CHAIN_DELAY;
    local_timer = m_params.high_freq_timer[0]->CC[1];

    if (local_timer > peer_timer)
    {
        timer_offset = TIME_SYNC_TIMER_MAX_VAL - local_timer + peer_timer;
    }
    else
    {
        timer_offset = peer_timer - local_timer;
    }

	/*
	 * FIXME:
	 * This is a PPI / timer timing issue:
	 * If the the CC[2] for the timer reset is too close to the timer overflow,
	 * the timer behavior becomes fuzzy...
	 * Probably because of the PPI + timer task delays, it is possible that the
	 * timestamp PPI task is executed after the timer was reset.
	 */
	if (timer_offset < 5)
	{
		m_trigger_evt.usedPacketCnt++;
		m_trigger_evt.lastSync = p_pkt->counter_val;
		return false;
	}

    if (timer_offset == 0 || timer_offset == TIME_SYNC_TIMER_MAX_VAL)
    {
        // Already in sync
    	m_trigger_evt.usedPacketCnt++;
    	m_trigger_evt.lastSync = p_pkt->counter_val;
        return false;
    }
    else if (timer_offset > TIME_SYNC_TIMER_MAX_VAL)
    {
        m_params.high_freq_timer[0]->CC[2] = (timer_offset - TIME_SYNC_TIMER_MAX_VAL);
    }
    else
    {
        m_params.high_freq_timer[0]->CC[2] = (TIME_SYNC_TIMER_MAX_VAL - timer_offset);
    }

    /*
     * This is necessary, because the following timer reset will not be counted as step
     */
    p_pkt->counter_val++;

    // resetting the timer to the trigger target will skip the trigger -> avoid this
	if (p_pkt->counter_val == m_trigger_evt.targetTick)
	{
		return false;
	}

	ASSERT(m_params.high_freq_timer[0]->CC[2] < TIME_SYNC_TIMER_MAX_VAL);

    m_timer_update_in_progress = true;
    mp_curr_adj_pkt            = p_pkt;

    ppi_sync_timer_adjust_enable();

    return true;
}

static void ppi_sync_timer_adjust_configure(void)
{
    uint32_t chn0, chn1, chg;

    chn0 = m_params.ppi_chns[0];
    chn1 = m_params.ppi_chns[1];
    chg  = m_params.ppi_chg;

    // PPI channel 0: clear timer when compare[2] value is reached
    NRF_PPI->CHENCLR        = (1 << chn0);
    NRF_PPI->CH[chn0].EEP   = (uint32_t) &m_params.high_freq_timer[0]->EVENTS_COMPARE[2];
    NRF_PPI->CH[chn0].TEP   = (uint32_t) &m_params.high_freq_timer[0]->TASKS_CLEAR;
    NRF_PPI->FORK[chn0].TEP = (uint32_t) &m_params.high_freq_timer[1]->TASKS_CLEAR;

    // PPI channel 1: disable PPI channel 0 such that the timer is only reset once, and trigger software interrupt
    NRF_PPI->CHENCLR        = (1 << chn1);
    NRF_PPI->CH[chn1].EEP   = (uint32_t) &m_params.high_freq_timer[0]->EVENTS_COMPARE[2];
    NRF_PPI->CH[chn1].TEP   = (uint32_t) &NRF_PPI->TASKS_CHG[chg].DIS;	// disable PPI group
    NRF_PPI->FORK[chn1].TEP = (uint32_t) &m_params.egu->TASKS_TRIGGER[0]; // trigger EGU interrupt

    NRF_PPI->TASKS_CHG[chg].DIS = 1;
    NRF_PPI->CHG[chg]           = (1 << chn0) | (1 << chn1);
}

static void ppi_radio_rx_configure(void)
{
    uint32_t chn;

    chn = m_params.ppi_chns[2];

    NRF_PPI->CH[chn].EEP   = (uint32_t) &NRF_RADIO->EVENTS_ADDRESS;
    NRF_PPI->CH[chn].TEP   = (uint32_t) &m_params.high_freq_timer[0]->TASKS_CAPTURE[1];
    NRF_PPI->FORK[chn].TEP = 0;
    NRF_PPI->CHENSET       = (1 << chn);
}

static void ppi_radio_tx_configure(void)
{
    uint32_t chn;

    chn = m_params.ppi_chns[0];

    NRF_PPI->CH[chn].EEP   = (uint32_t) &NRF_RADIO->EVENTS_READY;
    NRF_PPI->CH[chn].TEP   = (uint32_t) &m_params.high_freq_timer[0]->TASKS_CAPTURE[1];
    NRF_PPI->FORK[chn].TEP = (uint32_t) &m_params.high_freq_timer[1]->TASKS_CAPTURE[1];
    NRF_PPI->CHENSET       = (1 << chn);
}

static void ppi_timestamp_timer_configure(void)
{
    uint32_t chn;

    chn = m_params.ppi_chns[3];

    NRF_PPI->CH[chn].EEP   = (uint32_t) &m_params.high_freq_timer[0]->EVENTS_COMPARE[0];
    NRF_PPI->CH[chn].TEP   = (uint32_t) &m_params.high_freq_timer[1]->TASKS_COUNT;
    NRF_PPI->FORK[chn].TEP = 0;
    NRF_PPI->CHENSET       = (1 << chn);
}

